## Step1 : Connect to local database where Pagila is loaded

In [73]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [74]:
# connection
conn_string = "postgresql://postgres:707707@localhost:5432/pagila"
print(conn_string)

postgresql://postgres:707707@localhost:5432/pagila

In [75]:
%sql $conn_string

In [76]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;




print("nStores\t\t=", nStores[0][0])
print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nCity\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
nStores		= 2
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nCity		= 600
nCountry	= 109

## When? What time period are we talking about?

In [5]:
%%sql
select min(rental_date) as start, max(rental_date) as end from rental;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 53, 30), datetime.datetime(2006, 2, 14, 15, 16, 3))]

## Where ? Where do events in this database occur?

In [6]:
%%sql
select district, count(1) as Count
from address
group by district
order by Count desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

## Step3: Perform some simple Data Analysis

## 3.1.1 Films

In [7]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

## 3.1.2 Payments

In [8]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577))]

## 3.1.3 Inventory

In [10]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

## 3.1.4 Get the movie of every Payment

In [11]:
%%sql
Select f.title, p.amount, p.payment_date, p.customer_id
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), 269)]

## 3.1.5 sum movie rental revenue

In [12]:
%%sql
Select f.title, sum(p.amount) as revenue
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON ( r.inventory_id = i.inventory_id)
JOIN payment p ON (p.rental_id = r.rental_id)
GROUP BY title
ORDER BY revenue desc
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72'))]

## 3.2 Top Grossing Cities

## 3.2.1 Get the city of each payment

In [9]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city
from payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

## 3.2.2 Top Grocessing cities

In [11]:
%%sql
SELECT ci.city , sum(p.amount) as revenue
from payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
group by ci.city
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## 3.3 : Revenue of a movie by customer city and by month

## 3.3.1 Total revenue by month

In [12]:
%%sql
Select sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(Decimal('28559.46'), Decimal('4')),
 (Decimal('23886.56'), Decimal('3')),
 (Decimal('9631.88'), Decimal('2')),
 (Decimal('4824.43'), Decimal('1')),
 (Decimal('514.18'), Decimal('5'))]

## 3.3.2 Each movie by customer city and by month(data cube)

In [16]:
%%sql
Select f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month from p.payment_date) as month
from film f
JOIN inventory i ON (f.film_id = i.film_id)
JOIN rental r ON (i.inventory_id = r.inventory_id)
JOIN payment p ON (r.rental_id = p.rental_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
order by payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2007, 1, 24, 21, 21, 56, 996577), Decimal('1')),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2007, 1, 24, 21, 22, 59, 996577), Decimal('1')),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2007, 1, 24, 21, 32, 5, 996577), Decimal('1')),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2007, 1, 24, 21, 33, 7, 996577), Decimal('1')),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2007, 1, 24, 21, 33, 47, 996577), Decimal('1')),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2007, 1, 24, 21, 36, 33, 996577), Decimal('1')),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), Decimal('1')),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2007, 1, 24, 22, 0, 12, 996577), Decimal('1')),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2007, 1, 24, 22, 29, 6, 996577), Decimal('1')),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2007, 1, 24, 22, 30, 47, 996577), Decimal('1'))]

## 3.3.3 Sum of revenue of each movie by customer city and by month

In [21]:
%%sql
SELECT f.title, ci.city , sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
from payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (f.film_id = i.film_id)
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('SHOW LORD', 'Mannheim', Decimal('11.99'), Decimal('1')),
 ('KISSING DOLLS', 'Toulon', Decimal('10.99'), Decimal('1')),
 ('TELEGRAPH VOYAGE', 'Naala-Porto', Decimal('10.99'), Decimal('1')),
 ('AMERICAN CIRCUS', 'Callao', Decimal('10.99'), Decimal('1')),
 ('CASUALTIES ENCINO', 'Warren', Decimal('10.99'), Decimal('1')),
 ('AUTUMN CROW', 'Ashgabat', Decimal('9.99'), Decimal('1')),
 ('MIDSUMMER GROUNDHOG', 'Vaduz', Decimal('9.99'), Decimal('1')),
 ('DAY UNFAITHFUL', 'Baybay', Decimal('9.99'), Decimal('1')),
 ('CALIFORNIA BIRDS', 'Plock', Decimal('9.99'), Decimal('1')),
 ('DARKO DORADO', 'Bhilwara', Decimal('9.99'), Decimal('1'))]

## STEP 4 Creating Fact and Dimension

In [22]:
%%sql
Create table dimdate(
date_key integer NOT NULL PRIMARY KEY,
date date NOT NULL,
year smallint NOT NULL,
quarter smallint NOT NULL,
month smallint NOT NULL,
day smallint NOT NULL,
week smallint NOT NULL,
is_weekend boolean
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

In [23]:
%%sql
Create table dimCustomer(
customer_key SERIAL PRIMARY KEY,
customer_id smallint NOT NULL,
first_name varchar(45) NOT NULL,
last_name varchar(45) NOT NULL,
email varchar(50),
address varchar(50) NOT NULL,
address2 varchar(50),
district varchar(20) NOT NULL,
city varchar(50) NOT NULL,
country varchar(45) NOT NULL,
postal_code varchar(45),
phone varchar(45) NOT NULL,
active smallint NOT NULL,
create_date timestamp NOT NULL,
start_date date NOT NULL,
end_date date NOT NULL
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

In [24]:
%%sql
Create table dimMovie(
movie_key SERIAL PRIMARY KEY,
film_id smallint NOT NULL,
title varchar(255) NOT NULL,
description text,
release_year year,
language varchar(20) NOT NULL,
original_language varchar(20),
rental_duration smallint NOT NULL,
length smallint NOT NULL,
rating varchar(5) NOT NULL,
special_features varchar(100) NOT NULL
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

In [25]:
%%sql
Create table dimStore(
store_key SERIAL PRIMARY KEY,
store_id smallint NOT NULL,
address varchar(50) NOT NULL,
address2 varchar(50) NOT NULL,
district varchar(20) NOT NULL,
city varchar(50) NOT NULL,
country varchar(20) NOT NULL,
postal_code varchar(10),
manager_first_name varchar(50) NOT NULL,
manager_last_name varchar(50) NOT NULL,
start_date date NOT NULL,
end_date date NOT NULL
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

In [31]:
%%sql
Create table factSales
(
sales_key SERIAL PRIMARY KEY,
date_key INT NOT NULL REFERENCES dimDate (date_key),
customer_key INT NOT NULL REFERENCES dimCustomer (customer_key),
movie_key INT NOT NULL REFERENCES dimMovie(movie_key),
store_key INT NOT NULL REFERENCES dimStore(store_key),
sales_amount decimal(5,2) NOT NULL
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

## STEP 5: ETL the data from 3NF to Facts & Dimension tables

In [33]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
date(payment_date) AS date,
EXTRACT(year from payment_date) AS year,
EXTRACT(quarter from payment_date) AS quarter,
EXTRACT(month from payment_date) AS month,
EXTRACT(day from payment_date) AS day,
EXTRACT(week from payment_date) AS week,
CASE WHEN EXTRACT(ISODOW from payment_date) IN (6, 7) THEN true ELSE false END as is_weekend
from payment;

 * postgresql://postgres:***@localhost:5432/pagila
40 rows affected.

[]

In [35]:
%%sql
Select * from dimDate limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(20070302, datetime.date(2007, 3, 2), 2007, 1, 3, 2, 9, False),
 (20070214, datetime.date(2007, 2, 14), 2007, 1, 2, 14, 7, False),
 (20070407, datetime.date(2007, 4, 7), 2007, 2, 4, 7, 14, True),
 (20070429, datetime.date(2007, 4, 29), 2007, 2, 4, 29, 17, True),
 (20070130, datetime.date(2007, 1, 30), 2007, 1, 1, 30, 5, False),
 (20070216, datetime.date(2007, 2, 16), 2007, 1, 2, 16, 7, False),
 (20070125, datetime.date(2007, 1, 25), 2007, 1, 1, 25, 4, False),
 (20070323, datetime.date(2007, 3, 23), 2007, 1, 3, 23, 12, False),
 (20070428, datetime.date(2007, 4, 28), 2007, 2, 4, 28, 17, True),
 (20070410, datetime.date(2007, 4, 10), 2007, 2, 4, 10, 15, False)]

In [37]:
%%sql
INSERT into dimCustomer(customer_key, customer_id, first_name, last_name, email, address, address2, district, city, country, postal_code, phone, active, create_date, start_date, end_date)
SELECT c.customer_id as customer_key,
c.customer_id as customer_id,
c.first_name as first_name,
c.last_name as last_name,
c.email as email,
a.address as address,
a.address2 as address2,
a.district as district,
ci.city as city,
co.country as country,
a.postal_code as postal_code,
a.phone as phone,
c.active as active,
c.create_date as create_date,
now() as start_date,
now() as end_date
from customer c
JOIN address a On (a.address_id = c.address_id)
JOIN city ci ON (ci.city_id = a.city_id)
JOIN country co ON (co.country_id = ci.country_id)

 * postgresql://postgres:***@localhost:5432/pagila
599 rows affected.

[]

In [39]:
%%sql
Select * from dimCustomer limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (6, 6, 'JENNIFER', 'DAVIS', 'JENNIFER.DAVIS@sakilacustomer.org', '1795 Santiago de Compostela Way', '', 'Texas', 'Laredo', 'United States', '18743', '860452626434', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (7, 7, 'MARIA', 'MILLER', 'MARIA.MILLER@sakilacustomer.org', '900 Santiago de Compostela Parkway', '', 'Central Serbia', 'Kragujevac', 'Yugoslavia', '93896', '716571220373', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (8, 8, 'SUSAN', 'WILSON', 'SUSAN.WILSON@sakilacustomer.org', '478 Joliet Way', '', 'Hamilton', 'Hamilton', 'New Zealand', '77948', '657282285970', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (9, 9, 'MARGARET', 'MOORE', 'MARGARET.MOORE@sakilacustomer.org', '613 Korolev Drive', '', 'Masqat', 'Masqat', 'Oman', '45844', '380657522649', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (10, 10, 'DOROTHY', 'TAYLOR', 'DOROTHY.TAYLOR@sakilacustomer.org', '1531 Sal Drive', '', 'Esfahan', 'Esfahan', 'Iran', '53628', '648856936185', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 10, 9), datetime.date(2022, 10, 9))]

In [61]:
%%sql
INSERT into dimMovie(movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT
f.film_id as movie_key,
f.film_id as film_id,
f.title as title,
f.description as description,
f.release_year as release_year,
l.name as language,
ol.name as original_language,
f.rental_duration as rental_duration,
f.length as length,
f.rating as rating,
f.special_features as special_features
from film f
JOIN language l ON (l.language_id = f.language_id)
LEFT JOIN language ol ON (f.original_language_id = ol.language_id)

 * postgresql://postgres:***@localhost:5432/pagila
1000 rows affected.

[]

In [66]:
%%sql
select * from dimMovie limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', None, 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English', None, 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English', None, 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English', None, 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English', None, 6, 130, 'G', '{"Deleted Scenes"}'),
 (6, 6, 'AGENT TRUMAN', 'A Intrepid Panorama of a Robot And a Boy who must Escape a Sumo Wrestler in Ancient China', 2006, 'English', None, 3, 169, 'PG', '{"Deleted Scenes"}'),
 (7, 7, 'AIRPLANE SIERRA', 'A Touching Saga of a Hunter And a Butler who must Discover a Butler in A Jet Boat', 2006, 'English', None, 6, 62, 'PG-13', '{Trailers,"Deleted Scenes"}'),
 (8, 8, 'AIRPORT POLLOCK', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 'English', None, 6, 54, 'R', '{Trailers}'),
 (9, 9, 'ALABAMA DEVIL', 'A Thoughtful Panorama of a Database Administrator And a Mad Scientist who must Outgun a Mad Scientist in A Jet Boat', 2006, 'English', None, 3, 114, 'PG-13', '{Trailers,"Deleted Scenes"}'),
 (10, 10, 'ALADDIN CALENDAR', 'A Action-Packed Tale of a Man And a Lumberjack who must Reach a Feminist in Ancient China', 2006, 'English', None, 6, 63, 'NC-17', '{Trailers,"Deleted Scenes"}')]

In [65]:
%%sql
INSERT INTO dimStore(store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT
s.store_id as store_key,
s.store_id as store_id,
a.address as address,
a.address2 as address2,
a.district as district,
ci.city as city,
co.country as country,
a.postal_code as postal_code,
st.first_name as manager_first_name,
st.last_name as manager_last_name,
now() as start_date,
now() as end_date
from store s
JOIN staff st ON (s.store_id = st.store_id)
JOIN address a ON (a.address_id = st.address_id)
JOIN city ci ON (ci.city_id = a.city_id)
JOIN country co ON (co.country_id = ci.country_id)

 * postgresql://postgres:***@localhost:5432/pagila
2 rows affected.

[]

In [67]:
%%sql
Select * from dimStore limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
2 rows affected.

[(1, 1, '23 Workhaven Lane', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2022, 10, 9), datetime.date(2022, 10, 9)),
 (2, 2, '1411 Lillydale Drive', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2022, 10, 9), datetime.date(2022, 10, 9))]

In [84]:
%%sql
INSERT into factSales(date_key, customer_key, movie_key, store_key, sales_amount)
Select 
TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
p.customer_id as customer_key,
i.film_id as movie_key,
i.store_id as store_key,
p.amount as sales_amount
from payment p
JOIN rental r ON (r.rental_id = p.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id);

 * postgresql://postgres:***@localhost:5432/pagila
(psycopg2.errors.SyntaxError) INSERT has more target columns than expressions
LINE 1: ...key, date_key, customer_key, movie_key, store_key,sales_amou...
                                                             ^

[SQL: INSERT into factSales (sales_key, date_key, customer_key, movie_key, store_key,sales_amount)
Select
TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
p.customer_id as customer_key,
i.film_id as film_key,
i.store_id as store_key,
p.amount as sales_amount
from payment p
JOIN rental r ON (r.rental_id = p.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id);]
(Background on this error at: http://sqlalche.me/e/f405)